{
	"Defend The Castle": {
		"language": "JavaScript",
		"description": [
			"Defend the Castle is a fast-paced arcade-style video game, with a twist on the classic tower defense genre. The engine and game were written from scratch for a Nashville Software School front end capstone project, and it runs right in your browser (tested on Firefox and Google Chrome).",
			"I wanted to create this game from scratch, to better understand how game engines work under the hood. The biggest challenge surfaced when I discovered that the tutorial I was following didn't actually bring the game to a basic completion. The series had left me with a solid foundation, no doubt, consisting of a tile map loader, a game camera, keyboard input and a hero to control, some basic collision detection, and some entity handling. The rest was up to me. Did I really want to stick this through, knowing it would be extremely challenging? In the end, I had to fully immerse myself in to this code base, and really learn how it worked in order to achieve the results that I desired. It was a wonderful learning experience."
		],
		"iconImage": "temp4.png"
	},
	"Golden Beak Golf": {
		"language": "Pico-8 fantasy console",
		"description": [
            "Golden Beak Golf v1.0 was written during Ludum Dare 41 game jam. The theme was \"Combine two incompatible genres\". This game combines golfing and flappy bird!",
            "Golden Beak Golf v1.1 was an updated to smooth out a couple of things such as the menus, graphics, and physics.",
            "During Ludum Dare 41, about a dozen of us from the Nashville Game Developers crew were gathered at a house jamming on our games. This theme was definitely strange, and it took some of us most of friday evening to even figure out what kind of idea we would try to work with in the first place. I ended up liking the idea of combining sports and another genre, because I had never attempted making a sports game. I took a long drive during a lunch break on Saturday to get away and think about what I could possible combine to create a game. I don't remember exactly how, but I came up with the idea to combine golfing and flappy bird during this drive."
		],
		"iconImage": "temp4.png"
	}
}